// 47. Написать программу копирования массива

// написать свою или есть котовый метод  Array.Copy
// ?Что значит копировать? В новый массив или куда ?

// int[] a = {1,2,3};
// int[] b = a;

// Console.WriteLine(string.Join(",",a));
// Console.WriteLine(string.Join(",",b));